# Brewfile, install everything with `brew bundle`
# https://openfolder.sh/macos-migrations-with-brewfile

brew "aerc"            # Text based email
brew "asdf"            # Multi language package manager
brew "aspell"
brew "coreutils"       # GNU File, Shell, and Text utilities
brew "dict"            # dictionary server protocol (RFC2229) client
brew "direnv"          # loads/unloads a per folder .envrc
brew "entr"            # run commands when files change
brew "exercism"        # develop fluency with coding exercises and mentoring https://exercism.org
brew "gh"              # github cli https://cli.github.com/
brew "git-plus"        # git multi, git semvar, git relation, git old-branches, git recvent
brew "git-workspace"
brew "git"
brew "gnu-sed"         # GNU sed > Apple sed
brew "gnupg"
brew "go"
brew "hadolint"        # Linter for Dockerfile
brew "htop"            # prettier top, with colour
brew "hugo"            # static website generator
brew "iftop"           # top for your network interfaces
brew "jack"            # take audio output of software and send it to another
brew "jq"              # json formatter and queries
brew "less"            # gnu less gives me --wordwrap
brew "moreutils"       # for mr fetch | ts '%Y-%m-%dT%T%z'
brew "mplayer"
brew "mpv"             # command line media player https://mpv.io/
brew "mr"              # my-repos -- manage multiple git repos
brew "mtr"
brew "mutt"            # email
brew "ncdu"
brew "neovim"
brew "netcat"          # gnu netcat > osx netcat
brew "nmap"            # Port scanner
brew "pandoc"          # markdown formatter, but also used to convert between formats
brew "pgformatter"     # pg_format command to format sql
brew "postgresql@15"
brew "pstree"          # Hirachical list of processes
brew "rename"
brew "restic"          # Nobody wants backup, everyone wants restore https://restic.net/
brew "shellcheck"      # ncjones uses this for linting shell stuff
brew "stow"            # manage softlinks for dotfiles
brew "svn"             # required for font-source-code-pro
brew "termshark"       # cli replacement for wireshark
brew "tig"
brew "tree"
brew "trippy"          # network analysis replacement for traceroute and ping
brew "universal-ctags" # Maintained https://github.com/universal-ctags/ctags
brew "vale"            # Linter for English https://vale.sh/
brew "vim"
brew "vint"            # Linter for vimscript
brew "w3m"             # Text based browser
brew "watch"
brew "wget"
brew "zsh"

brew "lua"
brew "busted"   # Lua Unit testing
brew "luacheck" # Lua Linter

cask "anki"
cask "audacity"
cask "docker"
cask "font-hack"            # nice looking fixed width font
cask "font-iosevka"         # slab serif monospace font https://typeof.net/Iosevka/
cask "font-merriweather"    # modern serif font
cask "font-source-code-pro" # adobe backed fixed width font
cask "font-zilla-slab"
cask "gcloud-cli"           # GCP CLI
cask "ghostty"              # zig terminal emulator
cask "gimp"                 # image editing software
cask "hiddenbar"            # declutter the osx menu bar
cask "julia"                # Dynamic programming language
cask "keepassxc"            # compatible with keepassx files
cask "keepingyouawake"      # keeps the screen on for presentations
cask "linearmouse"          # tune sensitivity and acceleration
cask "signal"               # secure chat
cask "transmission"         # good for Linux ISOs
cask "vlc"

# brew "mas"     # App Store control from CLI https://github.com/mas-cli/mas
# brew "awscli"
# cask "wezterm" # Terminal emulator without splits
# cask "kitty"   # Fast but fiddly terminal emulator
# cask "iterm2"  # Bloated slow terminal emulator with AI

# brew "caddy"              # Open source web server with automatic HTTPS written in Go
# brew "dive"               # Inspect docker images
# brew "ranger"             # File browser
# brew "syncthing"          # Great, but not great for work machines as it often breaks policy
# cask "font-m-plus-1-code" # narrow fixed width for retina
# cask "jupyterlab"         # A Next-Generation Notebook Interface https://jupyter.org/
# cask "kicad"              # manual install, fab PCBs for http://jlcpcb.com
# cask "skype"
# cask "spotify"
# cask "tunnelblick"        # powers modest VPNs
# cask "unclack"            # for people with mech keebs, https://unclack.app
