# Brewfile, install everything with `brew bundle`
# https://openfolder.sh/macos-migrations-with-brewfile

tap 'homebrew/cask-fonts'

brew "asdf"       # Multi language package manager
brew "aspell"
brew "awscli"
brew "caddy"      # Open source web server with automatic HTTPS written in Go
brew "coreutils"  # GNU File, Shell, and Text utilities
brew "ctags"
brew "dict"       # dictionary server protocol (RFC2229) client
brew "direnv"
brew "entr"       # run commands when files change
brew "exercism"   # develop fluency with coding exercises and mentoring https://exercism.org
brew "git"
brew "git-plus"   # git multi, git semvar, git relation, git old-branches, git recvent
brew "git-workspace"
brew "gnupg"
brew "go"
brew "htop"       # prettier top, with colour
brew "hugo"       # static website generator
brew "iftop"      # top for your network interfaces
brew "jq"
brew "mas"        # App Store control from CLI https://github.com/mas-cli/mas
brew "moreutils"  # for mr fetch | ts '%Y-%m-%dT%T%z'
brew "mplayer"
brew "mpv"        # command line media player https://mpv.io/
brew "mr"         # manage multiple git repos
brew "mtr"
brew "ncdu"
brew "neovim"
brew "netcat"     # gnu netcat > osx netcat
brew "postgresql@15"
brew "pstree"     # Hirachical list of processes
brew "ranger"
brew "rename"
brew "restic"     # Nobody wants backup, everyone wants restore https://restic.net/
brew "shellcheck" # ncjones uses this for linting shell stuff
brew "stow"       # manage softlinks for dotfiles
brew "svn"        # required for font-source-code-pro
brew "syncthing"  # keep stuff synced across machines
brew "tig"
brew "tree"
brew "vim"
brew "watch"
brew "wget"
brew "zsh"

brew "lua"
brew "busted" # Unit testing in Lua

cask "anki"
cask "audacity"
cask "docker"
cask "font-hack"            # nice looking fixed width font
cask "font-mplus"           # narrow fixed width for retina
cask "font-source-code-pro" # adobe backed fixed width font
cask "gimp"                 # image editing software
cask "iterm2"               # terminal emulator
cask "julia"                # Dynamic programming language
cask "keepassxc"            # compatible with keepassx files
cask "linearmouse"          # tune sensitivity and acceleration
cask "keepingyouawake"      # keeps the screen on for presentations
cask "signal"               # secure chat
cask "transmission"         # good for Linux ISOs
cask "vlc"

# cask "jupyterlab"         # A Next-Generation Notebook Interface https://jupyter.org/
# cask "kicad"              # manual install, fab PCBs for http://jlcpcb.com
# cask "skype"
# cask "spotify"
# cask "tunnelblick"        # powers modest VPNs
# cask "unclack"            # for people with mech keebs, https://unclack.app
